Revit 2024 API
AirSystemData.ChilledWaterLoopId Property
 The chilled water loop used for the chilled water option of cooling coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public ElementId ChilledWaterLoopId { get; set; }
Visual Basic
Public Property ChilledWaterLoopId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ ChilledWaterLoopId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace